import React from 'react';

export interface FaqItem {
  question: string;
  answer: string | React.ReactNode;
}

export const faqData: FaqItem[] = [

  {
    question: 'Скільки фотографій я отримаю?',
    answer: 'Кількість залежить від формату зйомки. У середньому ви отримуєте від 60 до 100+ фотографій за годину зйомки.',
  },
  {
    question: 'Скільки фото буде в обробці?',
    answer: 'Усі вдалі фотографії проходять базову обробку (колір, світло, контраст).',
  },
  {
    question: 'Коли я отримаю готові фотографії?',
    answer: 'Зазвичай протягом 3–14 днів залежно від виду зйомки та сезону.',
  },
  {
    question: 'Як передаються готові фотографії?',
    answer: 'Через онлайн-галерею.',
  },
  {
    question: 'Чи віддаєте сирі фото (RAW)?',
    answer: 'Ні. RAW-файли є робочим матеріалом фотографа.',
  },
  {
    question: 'Чи можна отримати всі фотографії без обробки?',
    answer: 'Я передаю лише відібрані та оброблені фотографії, які відповідають моєму стилю роботи.',
  },
  {
    question: 'Чи допомагаєте з позуванням?',
    answer: 'Так. Під час зйомки підказую пози та допомагаю почуватися впевнено.',
  },
  {
    question: 'Я ніколи не фотографувався. Це проблема?',
    answer: 'Зовсім ні. Більшість клієнтів не мають досвіду — я допоможу на кожному етапі.',
  },
  {
    question: 'Що робити, якщо погана погода або відключення світла?',
    answer: 'Якщо зйомка на вулиці — перенесемо її на іншу дату. Або якщо діють графіки відключення світла, і в студії також немає світла, то зйомка переноситься на інший день.',
  },
  {
    question: 'Чи можна замовити фотокнигу?',
    answer: 'Так, доступні фотокниги різних форматів, для будь-яких подій.',
  },
  {
    question: 'Чи можна замовити подарунковий сертифікат?',
    answer: 'Так, подарункові сертифікати доступні.',
  },
  {
    question: 'Чи можна запросити друзів або родичів на фотосесію?',
    answer: 'Так, якщо це відповідає формату зйомки.',
  },
  {
    question: 'Чи потрібна передоплата?',
    answer: 'Передоплата потрібна не для всіх зйомок. Її розмір та необхідність залежать від формату. Студійні фотосесії, випускні та інші сезонні зйомки бронюються лише за 100% передоплатою.',
  },
  {
    question: 'Чому варто обрати саме мене?',
    answer: 'Я люблю свою справу та постійно вдосконалюю свої навички. Завжди на зв’язку, уважно вислухаю ваші побажання та зроблю все, щоб ви залишилися задоволені результатом.',
  },
];
